; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)
  (:functions 	(time-to-walk ?l1 ?l2 - location)
		(time-to-drive ?l1 ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-5-1-6-196)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	truck1 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	p4-5 - location
	p3-1 - location
	p3-4 - location
	p0-3 - location
	p2-0 - location
	p2-1 - location
	)
	(:init
	(at driver1 s5)
	(at driver2 s0)
	(at driver3 s5)
	(at driver4 s2)
	(at driver5 s5)
	(at truck1 s4)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at package1 s4)
	(at package2 s3)
	(at package3 s2)
	(at package4 s2)
	(at package5 s3)
	(at package6 s5)
	(path s4 p4-5)
	(path p4-5 s4)
	(path s5 p4-5)
	(path p4-5 s5)
	(= (time-to-walk s4 p4-5) 16)
	(= (time-to-walk p4-5 s4) 16)
	(= (time-to-walk s5 p4-5) 1)
	(= (time-to-walk p4-5 s5) 1)
	(path s3 p3-1)
	(path p3-1 s3)
	(path s1 p3-1)
	(path p3-1 s1)
	(= (time-to-walk s3 p3-1) 10)
	(= (time-to-walk p3-1 s3) 10)
	(= (time-to-walk s1 p3-1) 16)
	(= (time-to-walk p3-1 s1) 16)
	(path s3 p3-4)
	(path p3-4 s3)
	(path s4 p3-4)
	(path p3-4 s4)
	(= (time-to-walk s3 p3-4) 22)
	(= (time-to-walk p3-4 s3) 22)
	(= (time-to-walk s4 p3-4) 19)
	(= (time-to-walk p3-4 s4) 19)
	(path s0 p0-3)
	(path p0-3 s0)
	(path s3 p0-3)
	(path p0-3 s3)
	(= (time-to-walk s0 p0-3) 2)
	(= (time-to-walk p0-3 s0) 2)
	(= (time-to-walk s3 p0-3) 23)
	(= (time-to-walk p0-3 s3) 23)
	(path s2 p2-0)
	(path p2-0 s2)
	(path s0 p2-0)
	(path p2-0 s0)
	(= (time-to-walk s2 p2-0) 20)
	(= (time-to-walk p2-0 s2) 20)
	(= (time-to-walk s0 p2-0) 24)
	(= (time-to-walk p2-0 s0) 24)
	(path s2 p2-1)
	(path p2-1 s2)
	(path s1 p2-1)
	(path p2-1 s1)
	(= (time-to-walk s2 p2-1) 3)
	(= (time-to-walk p2-1 s2) 3)
	(= (time-to-walk s1 p2-1) 25)
	(= (time-to-walk p2-1 s1) 25)
	(link s2 s0)
	(link s0 s2)
	(= (time-to-drive s2 s0) 18)
	(= (time-to-drive s0 s2) 18)
	(link s1 s2)
	(link s2 s1)
	(= (time-to-drive s1 s2) 6)
	(= (time-to-drive s2 s1) 6)
	(link s4 s1)
	(link s1 s4)
	(= (time-to-drive s4 s1) 4)
	(= (time-to-drive s1 s4) 4)
	(link s4 s2)
	(link s2 s4)
	(= (time-to-drive s4 s2) 16)
	(= (time-to-drive s2 s4) 16)
	(link s3 s0)
	(link s0 s3)
	(= (time-to-drive s3 s0) 4)
	(= (time-to-drive s0 s3) 4)
	(link s3 s1)
	(link s1 s3)
	(= (time-to-drive s3 s1) 2)
	(= (time-to-drive s1 s3) 2)
	(link s3 s2)
	(link s2 s3)
	(= (time-to-drive s3 s2) 15)
	(= (time-to-drive s2 s3) 15)
	(link s3 s4)
	(link s4 s3)
	(= (time-to-drive s3 s4) 16)
	(= (time-to-drive s4 s3) 16)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 4)
	(= (time-to-drive s1 s0) 4)
	(link s0 s4)
	(link s4 s0)
	(= (time-to-drive s0 s4) 18)
	(= (time-to-drive s4 s0) 18)
	(link s5 s1)
	(link s1 s5)
	(= (time-to-drive s5 s1) 10)
	(= (time-to-drive s1 s5) 10)
	(link s5 s2)
	(link s2 s5)
	(= (time-to-drive s5 s2) 17)
	(= (time-to-drive s2 s5) 17)
	(link s5 s3)
	(link s3 s5)
	(= (time-to-drive s5 s3) 12)
	(= (time-to-drive s3 s5) 12)
	(link s5 s4)
	(link s4 s5)
	(= (time-to-drive s5 s4) 20)
	(= (time-to-drive s4 s5) 20)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver1 s2)
	(at driver3 s2)
	(at driver4 s2)
	(at truck1 s0)
	(at package1 s3)
	(at package2 s0)
	(at package3 s3)
	(at package5 s5)
	(at package6 s3)
	))

(:metric minimize (+ (* 4 (total-time)) (* 4 (fuel-used))))

)

; plan
1. (load-truck package1 truck1 s4)
   deleted: (at package1 s4)
   added: (in package1 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 1 of 9
2. (walk driver1 s5 p4-5)
   deleted: (at driver1 s5)
   added: (at driver1 p4-5)
   goals met: 1 of 9
3. (walk driver1 p4-5 s4)
   deleted: (at driver1 p4-5)
   added: (at driver1 s4)
   goals met: 1 of 9
4. (board-truck driver1 truck1 s4)
   deleted: (at driver1 s4) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 1 of 9
5. (drive-truck truck1 s4 s2 driver1)
   deleted: (at truck1 s4)
   added: (at truck1 s2)
   changed: (fuel-used) from 0 to 176
   goals met: 1 of 9
6. (load-truck package3 truck1 s2)
   deleted: (at package3 s2)
   added: (in package3 truck1)
   changed: (load truck1) from 1 to 2, (fuel-per-minute truck1) from 11 to 13
   goals met: 1 of 9
7. (drive-truck truck1 s2 s3 driver1)
   deleted: (at truck1 s2)
   added: (at truck1 s3)
   changed: (fuel-used) from 176 to 371
   goals met: 1 of 9
8. (unload-truck package1 truck1 s3)
   deleted: (in package1 truck1)
   added: (at package1 s3)
   changed: (load truck1) from 2 to 1, (fuel-per-minute truck1) from 13 to 11
   goals met: 2 of 9
9. (unload-truck package3 truck1 s3)
   deleted: (in package3 truck1)
   added: (at package3 s3)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 3 of 9
10. (load-truck package2 truck1 s3)
   deleted: (at package2 s3)
   added: (in package2 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 3 of 9
11. (load-truck package5 truck1 s3)
   deleted: (at package5 s3)
   added: (in package5 truck1)
   changed: (load truck1) from 1 to 2, (fuel-per-minute truck1) from 11 to 13
   goals met: 3 of 9
12. (drive-truck truck1 s3 s5 driver1)
   deleted: (at truck1 s3)
   added: (at truck1 s5)
   changed: (fuel-used) from 371 to 527
   goals met: 3 of 9
13. (load-truck package6 truck1 s5)
   deleted: (at package6 s5)
   added: (in package6 truck1)
   changed: (load truck1) from 2 to 3, (fuel-per-minute truck1) from 13 to 16
   goals met: 3 of 9
14. (unload-truck package5 truck1 s5)
   deleted: (in package5 truck1)
   added: (at package5 s5)
   changed: (load truck1) from 3 to 2, (fuel-per-minute truck1) from 16 to 13
   goals met: 4 of 9
15. (drive-truck truck1 s5 s3 driver1)
   deleted: (at truck1 s5)
   added: (at truck1 s3)
   changed: (fuel-used) from 527 to 683
   goals met: 4 of 9
16. (unload-truck package6 truck1 s3)
   deleted: (in package6 truck1)
   added: (at package6 s3)
   changed: (load truck1) from 2 to 1, (fuel-per-minute truck1) from 13 to 11
   goals met: 5 of 9
17. (drive-truck truck1 s3 s2 driver1)
   deleted: (at truck1 s3)
   added: (at truck1 s2)
   changed: (fuel-used) from 683 to 848
   goals met: 5 of 9
18. (disembark-truck driver1 truck1 s2)
   deleted: (driving driver1 truck1)
   added: (at driver1 s2) (empty truck1)
   goals met: 6 of 9
19. (walk driver3 s5 p4-5)
   deleted: (at driver3 s5)
   added: (at driver3 p4-5)
   goals met: 6 of 9
20. (board-truck driver1 truck1 s2)
   deleted: (at driver1 s2) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 5 of 9
21. (walk driver3 p4-5 s4)
   deleted: (at driver3 p4-5)
   added: (at driver3 s4)
   goals met: 5 of 9
22. (drive-truck truck1 s2 s4 driver1)
   deleted: (at truck1 s2)
   added: (at truck1 s4)
   changed: (fuel-used) from 848 to 1024
   goals met: 5 of 9
23. (disembark-truck driver1 truck1 s4)
   deleted: (driving driver1 truck1)
   added: (at driver1 s4) (empty truck1)
   goals met: 5 of 9
24. (board-truck driver3 truck1 s4)
   deleted: (at driver3 s4) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 5 of 9
25. (drive-truck truck1 s4 s0 driver3)
   deleted: (at truck1 s4)
   added: (at truck1 s0)
   changed: (fuel-used) from 1024 to 1222
   goals met: 6 of 9
26. (unload-truck package2 truck1 s0)
   deleted: (in package2 truck1)
   added: (at package2 s0)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 7 of 9
27. (disembark-truck driver3 truck1 s0)
   deleted: (driving driver3 truck1)
   added: (at driver3 s0) (empty truck1)
   goals met: 7 of 9
28. (walk driver3 s0 p2-0)
   deleted: (at driver3 s0)
   added: (at driver3 p2-0)
   goals met: 7 of 9
29. (board-truck driver2 truck1 s0)
   deleted: (at driver2 s0) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 7 of 9
30. (drive-truck truck1 s0 s2 driver2)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   changed: (fuel-used) from 1222 to 1402
   goals met: 6 of 9
31. (disembark-truck driver2 truck1 s2)
   deleted: (driving driver2 truck1)
   added: (at driver2 s2) (empty truck1)
   goals met: 6 of 9
32. (walk driver1 s4 p3-4)
   deleted: (at driver1 s4)
   added: (at driver1 p3-4)
   goals met: 6 of 9
33. (walk driver3 p2-0 s2)
   deleted: (at driver3 p2-0)
   added: (at driver3 s2)
   goals met: 7 of 9
34. (walk driver1 p3-4 s3)
   deleted: (at driver1 p3-4)
   added: (at driver1 s3)
   goals met: 7 of 9
35. (board-truck driver3 truck1 s2)
   deleted: (at driver3 s2) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 6 of 9
36. (drive-truck truck1 s2 s0 driver3)
   deleted: (at truck1 s2)
   added: (at truck1 s0)
   changed: (fuel-used) from 1402 to 1582
   goals met: 7 of 9
37. (disembark-truck driver3 truck1 s0)
   deleted: (driving driver3 truck1)
   added: (at driver3 s0) (empty truck1)
   goals met: 7 of 9
38. (walk driver1 s3 p3-1)
   deleted: (at driver1 s3)
   added: (at driver1 p3-1)
   goals met: 7 of 9
39. (walk driver3 s0 p2-0)
   deleted: (at driver3 s0)
   added: (at driver3 p2-0)
   goals met: 7 of 9
40. (walk driver3 p2-0 s2)
   deleted: (at driver3 p2-0)
   added: (at driver3 s2)
   goals met: 8 of 9
41. (walk driver1 p3-1 s1)
   deleted: (at driver1 p3-1)
   added: (at driver1 s1)
   goals met: 8 of 9
42. (walk driver1 s1 p2-1)
   deleted: (at driver1 s1)
   added: (at driver1 p2-1)
   goals met: 8 of 9
43. (walk driver1 p2-1 s2)
   deleted: (at driver1 p2-1)
   added: (at driver1 s2)
   goals met: 9 of 9
